Cannot make landing because height of landing is equal or less than to bottom height of the stair.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId LandingHeightUnderStairsBottom { get; }
  Visual Basic
Public Shared ReadOnly Property LandingHeightUnderStairsBottom As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ LandingHeightUnderStairsBottom {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace